#!/usr/bin/env python
#coding=utf-8

#from tkinter import *
#import tkinter.ttk as ttk
import os
import requests
from bs4 import BeautifulSoup
import ast
#import urllib.request as req
import urllib
import subprocess

from PIL import Image, ImageTk
from datetime import datetime, timedelta
import time
import textwrap


url_dict = {
    "山手線": '21/0', 
    "京浜東北根岸線": '22/0',
    "湘南新宿ライン": '25/0',
    "東海道本線[東京～熱海]": '27/0',
    "横須賀線": '29/0',
    "横浜線": '31/0',
    "相模線": '33/0',
    "南部線[川崎～立川]": '34/0',
    "鶴見線": '36/0',
    "南部線[浜川崎～尻手]": '37/0',
    "中央線(快速)[東京～高尾]": '38/0',
    "中央総武線(各停)": '40/0',
    "中央線[高尾～大月]": '42/0',
    "青梅線[立川～青梅]": '43/43',
    "青梅線[青梅～奥多摩]": '43/44',
    "五日市線": '45/0',
    "宇都宮線[東京～宇都宮]": '46/46',
    "宇都宮線[宇都宮～黒磯]": '46/47',
    "高崎線": '48/0',
    "埼京川越線[羽沢横浜国大～川越]": '50/0',
    "八高川越線[八王子～川越]": '52/0',
    "八高線[高麗川～高崎]": '54/0',
    "日光線": '55/0',
    "烏山線": '56/0',
    "常磐線(快速)[品川～取手]": '57/0',
    "常磐線(各停)": '58/0',
    "常磐線[品川～水戸]": '59/59',
    "常磐線[水戸～いわき]": '59/60',
    "総武線(快速)[東京～千葉]": '61/0',
    "総武本線[千葉～銚子]": '62/0',
    "内房線": '63/0',
    "外房線": '65/0',
    "成田線[我孫子～成田]": '67/0',
    "成田線[千葉～成田空港・銚子]": '68/0',
    "京葉線": '69/0',
    "武蔵野線": '71/0',
    "東金線": '74/0',
    "久留里線": '75/0',
    "鹿島線": '76/0',
    "吾妻線": '162/0',
    "伊東線": '163/0',
    "上越線[高崎～水上]": '164/0',
    "信越本線[高崎～横川]": '165/0',
    "水郡線": '166/0',
    "水戸線": '167/0',
    "両毛線": '168/0',
    "上野東京ライン": '627/0',
    "東武スカイツリーライン": '77/0',
    "東武亀戸線": '78/0',
    "東武大師線": '79/0',
    "東武日光線[南栗橋～東武日光]": '80/0',
    "東武アーバンパークライン": '81/0',
    "東武東上線": '82/0',
    "東武越生線": '83/0',
    "東武宇都宮線": '169/0',
    "東武鬼怒川線": '170/0',
    "東武小泉線": '171/0',
    "東武佐野線": '172/0',
    "東武桐生線": '173/0',
    "東武伊勢崎線[久喜～伊勢崎]": '639/0',
    "西武池袋線・秩父線": '84/0',
    "西武新宿線": '86/0',
    "西武西武園線": '87/0',
    "西武国分寺線": '88/0',
    "西武多摩湖線": '89/0',
    "西武有楽町線": '90/0',
    "西武豊島線": '91/0',
    "西武狭山線": '92/0',
    "西武拝島線": '93/0',
    "西武多摩川線": '94/0',
    "西武山口線": '95/0',
    "東京メトロ銀座線": '132/0',
    "東京メトロ丸ノ内線": '133/0',
    "東京メトロ日比谷線": '134/0',
    "東京メトロ東西線": '135/0',
    "東京メトロ千代田線": '136/0',
    "東京メトロ有楽町線": '137/0',
    "東京メトロ半蔵門線": '138/0',
    "東京メトロ南北線": '139/0',
    "東京メトロ副都心線": '540/0',
    "京王線": '102/0',
    "京王新線": '103/0',
    "京王相模原線": '104/0',
    "京王高尾線": '105/0',
    "京王競馬場線": '106/0',
    "京王動物園線": '107/0',
    "京王井の頭線": '108/0',
    "東急東横線": '112/0',
    "東急目黒線": '113/0',
    "東急田園都市線": '114/0',
    "東急大井町線": '115/0',
    "東急多摩川線": '116/0',
    "東急多摩川線": '117/0',
    "東急世田谷線": '119/0',
    "京成本線": '96/0',
    "京成東成田線": '97/0',
    "京成押上線": '98/0',
    "京成千葉線・千原線": '99/0',
    "京成金町線": '101/0',
    "都営浅草線": '128/0',
    "都営三田線": '129/0',
    "都営新宿線": '130/0',
    "都営大江戸線": '131/0',
    "都電荒川線": '190/0',
    "成田スカイアクセス線": '622/0',
    "日暮里・舎人ライナー": '541/0',
    "京急本線": '120/0',
    "京急空港線": '121/0',
    "京急大師線": '122/0',
    "京急大師線": '123/0',
    "京急久里浜線": '124/0',
    "小田急小田原線": '109/0',
    "小田急江ノ島線": '110/0',
    "小田急多摩線": '111/0',
    "関東鉄道常総線": '175/0',
    "関東鉄道竜ケ崎線": '176/0',
    "みなとみらい線": '401/0',
    "こどもの国線": '402/0',
    "ブルーライン": '140/0',
    "グリーンライン": '539/0',
    "銚子電鉄線": '181/0',
    "ひたちなか海浜鉄道湊線": '177/0',
    "ニューシャトル": '161/0',
    "上信電鉄線": '179/0',
    "上毛電鉄線": '180/0',
    "ディズニーリゾートライン": '188/0',
    "伊豆急行線": '182/0',
    "野岩鉄道会津鬼怒川線": '184/0',
    "わたらせ渓谷鐵道線": '185/0',
    "鹿島臨海鉄道大洗鹿島線": '186/0',
    "真岡鐵道線": '187/0',
    "シーサイドライン": '159/0',
    "山万ユーカリが丘線": '189/0',
    "つくばエクスプレス線": '412/0',
    "ゆりかもめ線": '160/0',
    "富士急行線": '151/0',
    "千葉都市モノレール線": '157/0',
    "流鉄流山線": '145/0',
    "相鉄線": '125/0',
    "新京成線": '127/0',
    "北総線": '141/0',
    "東葉高速線": '142/0',
    "埼玉高速鉄道線": '143/0',
    "りんかい線": '144/0',
    "秩父鉄道線": '146/0',
    "多摩都市モノレール線": '156/0',
    "箱根登山鉄道線": '147/0',
    "江ノ島電鉄線": '148/0',
    "小湊鉄道線": '149/0',
    "いすみ鉄道線": '150/0',
    "伊豆箱根鉄道大雄山線": '153/0',
    "東京モノレール線": '154/0',
    "湘南モノレール線": '155/0',
    "芝山鉄道線": '562/0'
}
URLHEDDER = "https://transit.yahoo.co.jp/traininfo/detail/"


def printTrainInfo(train_list):
    # 登録路線の運行情報を取得
    for item in train_list:
        urldata = URLHEDDER + str(item) +"/0/"
        web_requests = requests.get(urldata)

        for key,value in url_dict.items():
            val=item+"/0"
            if value == val :
                line_name = key 


    # BeautifulSoupを利用してWebページを解析する
        soup = BeautifulSoup(
            web_requests.text, 'html.parser')

    # .findでtroubleクラスのddタグを探す
        if soup.find('dd', class_='trouble'):
            status = "trouble"
            text_list=textwrap.wrap(soup.find('dd',class_='trouble').get_text(), 20)
            trouble_text='<p2>'+line_name+'</p2><br>'+'\n<p3>'.join(text_list)+'</p3><br>'
            print(trouble_text)
            bg="red4"


if __name__ == "__main__":
    printTrainInfo({ "102", "103", "104", "130", "137" })
